; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p4---int100n150-m25---int100c200---s18---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 - fuellevel
)

(:init
(sum level0 level13 level13)
(sum level0 level19 level19)
(sum level0 level23 level23)
(sum level1 level13 level14)
(sum level1 level19 level20)
(sum level1 level23 level24)
(sum level2 level13 level15)
(sum level2 level19 level21)
(sum level2 level23 level25)
(sum level3 level13 level16)
(sum level3 level19 level22)
(sum level3 level23 level26)
(sum level4 level13 level17)
(sum level4 level19 level23)
(sum level4 level23 level27)
(sum level5 level13 level18)
(sum level5 level19 level24)
(sum level5 level23 level28)
(sum level6 level13 level19)
(sum level6 level19 level25)
(sum level6 level23 level29)
(sum level7 level13 level20)
(sum level7 level19 level26)
(sum level7 level23 level30)
(sum level8 level13 level21)
(sum level8 level19 level27)
(sum level8 level23 level31)
(sum level9 level13 level22)
(sum level9 level19 level28)
(sum level9 level23 level32)
(sum level10 level13 level23)
(sum level10 level19 level29)
(sum level10 level23 level33)
(sum level11 level13 level24)
(sum level11 level19 level30)
(sum level11 level23 level34)
(sum level12 level13 level25)
(sum level12 level19 level31)
(sum level12 level23 level35)
(sum level13 level13 level26)
(sum level13 level19 level32)
(sum level13 level23 level36)
(sum level14 level13 level27)
(sum level14 level19 level33)
(sum level14 level23 level37)
(sum level15 level13 level28)
(sum level15 level19 level34)
(sum level15 level23 level38)
(sum level16 level13 level29)
(sum level16 level19 level35)
(sum level16 level23 level39)
(sum level17 level13 level30)
(sum level17 level19 level36)
(sum level17 level23 level40)
(sum level18 level13 level31)
(sum level18 level19 level37)
(sum level18 level23 level41)
(sum level19 level13 level32)
(sum level19 level19 level38)
(sum level19 level23 level42)
(sum level20 level13 level33)
(sum level20 level19 level39)
(sum level20 level23 level43)
(sum level21 level13 level34)
(sum level21 level19 level40)
(sum level21 level23 level44)
(sum level22 level13 level35)
(sum level22 level19 level41)
(sum level22 level23 level45)
(sum level23 level13 level36)
(sum level23 level19 level42)
(sum level23 level23 level46)
(sum level24 level13 level37)
(sum level24 level19 level43)
(sum level24 level23 level47)
(sum level25 level13 level38)
(sum level25 level19 level44)
(sum level25 level23 level48)
(sum level26 level13 level39)
(sum level26 level19 level45)
(sum level26 level23 level49)
(sum level27 level13 level40)
(sum level27 level19 level46)
(sum level27 level23 level50)
(sum level28 level13 level41)
(sum level28 level19 level47)
(sum level28 level23 level51)
(sum level29 level13 level42)
(sum level29 level19 level48)
(sum level29 level23 level52)
(sum level30 level13 level43)
(sum level30 level19 level49)
(sum level30 level23 level53)
(sum level31 level13 level44)
(sum level31 level19 level50)
(sum level31 level23 level54)
(sum level32 level13 level45)
(sum level32 level19 level51)
(sum level32 level23 level55)
(sum level33 level13 level46)
(sum level33 level19 level52)
(sum level33 level23 level56)
(sum level34 level13 level47)
(sum level34 level19 level53)
(sum level34 level23 level57)
(sum level35 level13 level48)
(sum level35 level19 level54)
(sum level35 level23 level58)
(sum level36 level13 level49)
(sum level36 level19 level55)
(sum level36 level23 level59)
(sum level37 level13 level50)
(sum level37 level19 level56)
(sum level37 level23 level60)
(sum level38 level13 level51)
(sum level38 level19 level57)
(sum level38 level23 level61)
(sum level39 level13 level52)
(sum level39 level19 level58)
(sum level39 level23 level62)
(sum level40 level13 level53)
(sum level40 level19 level59)
(sum level40 level23 level63)
(sum level41 level13 level54)
(sum level41 level19 level60)
(sum level41 level23 level64)
(sum level42 level13 level55)
(sum level42 level19 level61)
(sum level42 level23 level65)
(sum level43 level13 level56)
(sum level43 level19 level62)
(sum level43 level23 level66)
(sum level44 level13 level57)
(sum level44 level19 level63)
(sum level44 level23 level67)
(sum level45 level13 level58)
(sum level45 level19 level64)
(sum level45 level23 level68)
(sum level46 level13 level59)
(sum level46 level19 level65)
(sum level46 level23 level69)
(sum level47 level13 level60)
(sum level47 level19 level66)
(sum level47 level23 level70)
(sum level48 level13 level61)
(sum level48 level19 level67)
(sum level48 level23 level71)
(sum level49 level13 level62)
(sum level49 level19 level68)
(sum level49 level23 level72)
(sum level50 level13 level63)
(sum level50 level19 level69)
(sum level50 level23 level73)
(sum level51 level13 level64)
(sum level51 level19 level70)
(sum level51 level23 level74)
(sum level52 level13 level65)
(sum level52 level19 level71)
(sum level52 level23 level75)
(sum level53 level13 level66)
(sum level53 level19 level72)
(sum level53 level23 level76)
(sum level54 level13 level67)
(sum level54 level19 level73)
(sum level54 level23 level77)
(sum level55 level13 level68)
(sum level55 level19 level74)
(sum level55 level23 level78)
(sum level56 level13 level69)
(sum level56 level19 level75)
(sum level56 level23 level79)
(sum level57 level13 level70)
(sum level57 level19 level76)
(sum level57 level23 level80)
(sum level58 level13 level71)
(sum level58 level19 level77)
(sum level58 level23 level81)
(sum level59 level13 level72)
(sum level59 level19 level78)
(sum level59 level23 level82)
(sum level60 level13 level73)
(sum level60 level19 level79)
(sum level60 level23 level83)
(sum level61 level13 level74)
(sum level61 level19 level80)
(sum level61 level23 level84)
(sum level62 level13 level75)
(sum level62 level19 level81)
(sum level62 level23 level85)
(sum level63 level13 level76)
(sum level63 level19 level82)
(sum level63 level23 level86)
(sum level64 level13 level77)
(sum level64 level19 level83)
(sum level64 level23 level87)
(sum level65 level13 level78)
(sum level65 level19 level84)
(sum level65 level23 level88)
(sum level66 level13 level79)
(sum level66 level19 level85)
(sum level66 level23 level89)
(sum level67 level13 level80)
(sum level67 level19 level86)
(sum level67 level23 level90)
(sum level68 level13 level81)
(sum level68 level19 level87)
(sum level68 level23 level91)
(sum level69 level13 level82)
(sum level69 level19 level88)
(sum level69 level23 level92)
(sum level70 level13 level83)
(sum level70 level19 level89)
(sum level70 level23 level93)
(sum level71 level13 level84)
(sum level71 level19 level90)
(sum level71 level23 level94)
(sum level72 level13 level85)
(sum level72 level19 level91)
(sum level72 level23 level95)
(sum level73 level13 level86)
(sum level73 level19 level92)
(sum level73 level23 level96)
(sum level74 level13 level87)
(sum level74 level19 level93)
(sum level74 level23 level97)
(sum level75 level13 level88)
(sum level75 level19 level94)
(sum level75 level23 level98)
(sum level76 level13 level89)
(sum level76 level19 level95)
(sum level76 level23 level99)
(sum level77 level13 level90)
(sum level77 level19 level96)
(sum level77 level23 level100)
(sum level78 level13 level91)
(sum level78 level19 level97)
(sum level78 level23 level101)
(sum level79 level13 level92)
(sum level79 level19 level98)
(sum level79 level23 level102)
(sum level80 level13 level93)
(sum level80 level19 level99)
(sum level80 level23 level103)
(sum level81 level13 level94)
(sum level81 level19 level100)
(sum level81 level23 level104)
(sum level82 level13 level95)
(sum level82 level19 level101)
(sum level82 level23 level105)
(sum level83 level13 level96)
(sum level83 level19 level102)
(sum level83 level23 level106)
(sum level84 level13 level97)
(sum level84 level19 level103)
(sum level84 level23 level107)
(sum level85 level13 level98)
(sum level85 level19 level104)
(sum level85 level23 level108)
(sum level86 level13 level99)
(sum level86 level19 level105)
(sum level86 level23 level109)
(sum level87 level13 level100)
(sum level87 level19 level106)
(sum level87 level23 level110)
(sum level88 level13 level101)
(sum level88 level19 level107)
(sum level89 level13 level102)
(sum level89 level19 level108)
(sum level90 level13 level103)
(sum level90 level19 level109)
(sum level91 level13 level104)
(sum level91 level19 level110)
(sum level92 level13 level105)
(sum level93 level13 level106)
(sum level94 level13 level107)
(sum level95 level13 level108)
(sum level96 level13 level109)
(sum level97 level13 level110)

(connected l0 l1)
(fuelcost level13 l0 l1)
(connected l0 l2)
(fuelcost level19 l0 l2)
(connected l1 l0)
(fuelcost level13 l1 l0)
(connected l1 l2)
(fuelcost level23 l1 l2)
(connected l2 l0)
(fuelcost level19 l2 l0)
(connected l2 l1)
(fuelcost level23 l2 l1)

(at t0 l1)
(fuel t0 level110)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l0)
(at p3 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l2)
(at p3 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l1 l0 level97 level13 level110)
   deleted: (at t0 l1) (fuel t0 level110)
   added: (at t0 l0) (fuel t0 level97)
   goals met: 0 of 4
2. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 4
3. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 4
4. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 4
5. (drive t0 l0 l2 level78 level19 level97)
   deleted: (at t0 l0) (fuel t0 level97)
   added: (at t0 l2) (fuel t0 level78)
   goals met: 0 of 4
6. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 4
7. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 1 of 4
8. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 2 of 4
9. (drive t0 l2 l1 level55 level23 level78)
   deleted: (at t0 l2) (fuel t0 level78)
   added: (at t0 l1) (fuel t0 level55)
   goals met: 2 of 4
10. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 3 of 4
11. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 4 of 4
